podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/QuadSPI_S32K148.svd.xml
            <register>
               <name>SOCCR</name>
               <description>SOC Configuration Register</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>SOCCFG</name>
                     <description>SOC Configuration For details, refer to chip-specific QuadSPI information</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>BUF0IND</name>
               <description>Buffer0 Top Index Register</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>TPINDX0</name>
                     <description>Top index of buffer 0</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BUF1IND</name>
               <description>Buffer1 Top Index Register</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>TPINDX1</name>
                     <description>Top index of buffer 1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BUF2IND</name>
               <description>Buffer2 Top Index Register</description>
               <addressOffset>0x38</addressOffset>
               <fields>
                  <field>
                     <name>TPINDX2</name>
                     <description>Top index of buffer 2</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SFAR</name>
               <description>Serial Flash Address Register</description>
               <addressOffset>0x100</addressOffset>
               <fields>
                  <field>
                     <name>SFADR</name>
                     <description>Serial Flash Address. The register content is used as byte address for all following IP Commands</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SFACR</name>
               <description>Serial Flash Address Configuration Register</description>
               <addressOffset>0x104</addressOffset>
               <fields>
                  <field>
                     <name>CAS</name>
                     <description>Column Address Space</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>WA</name>
                     <description>Word Addressable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Byte addressable serial flash mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Word (2 byte) addressable serial flash mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMPR</name>
               <description>Sampling Register</description>
               <addressOffset>0x108</addressOffset>
               <fields>
                  <field>
                     <name>FSPHS</name>
                     <description>Full Speed Phase selection for SDR instructions</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Select sampling at non-inverted clock</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Select sampling at inverted clock</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSDLY</name>
                     <description>Full Speed Delay selection for SDR instructions. Select the delay with respect to the reference edge for the sample point valid for full speed commands</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>One clock cycle delay</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Two clock cycles delay</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RBSR</name>
               <description>RX Buffer Status Register</description>
               <addressOffset>0x10C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RDBFL</name>
                     <description>RX Buffer Fill Level</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RDCTR</name>
                     <description>Read Counter</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RBCT</name>
               <description>RX Buffer Control Register</description>
               <addressOffset>0x110</addressOffset>
               <fields>
                  <field>
                     <name>WMRK</name>
                     <description>RX Buffer Watermark</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>RXBRD</name>
                     <description>RX Buffer Readout. This field specifies the access scheme for the RX Buffer readout</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>RX Buffer content is read using the AHB Bus registers QSPI_ARDB0 to QSPI_ARDB31. For details, refer to Exclusive Access to Serial Flash for AHB Commands</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>RX Buffer content is read using the IP Bus registers QSPI_RBDR0 to QSPI_RBDR31</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBSR</name>
               <description>TX Buffer Status Register</description>
               <addressOffset>0x150</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TRBFL</name>
                     <description>TX Buffer Fill Level</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TRCTR</name>
                     <description>Transmit Counter</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBDR</name>
               <description>TX Buffer Data Register</description>
               <addressOffset>0x154</addressOffset>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>TX Data On write access the data is written into the next available entry of the TX Buffer and the QPSI_TBSR[TRBFL] field is updated accordingly</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBCT</name>
               <description>Tx Buffer Control Register</description>
               <addressOffset>0x158</addressOffset>
               <fields>
                  <field>
                     <name>WMRK</name>
                     <description>Determines the watermark for the TX Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>Status Register</description>
               <addressOffset>0x15C</addressOffset>
               <access>read-only</access>
               <resetValue>0x2003800</resetValue>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>Module Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IP_ACC</name>
                     <description>IP Access. Asserted when transaction currently executed was initiated by IP bus</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB_ACC</name>
                     <description>AHB Access. Asserted when the transaction currently executed was initiated by AHB bus</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHBGNT</name>
                     <description>AHB Command priority Granted: Asserted when another module has been granted priority of AHB Commands against IP Commands</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHBTRN</name>
                     <description>AHB Access Transaction pending</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB0NE</name>
                     <description>AHB 0 Buffer Not Empty. Asserted when AHB 0 buffer contains data</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB1NE</name>
                     <description>AHB 1 Buffer Not Empty. Asserted when AHB 1 buffer contains data</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB2NE</name>
                     <description>AHB 2 Buffer Not Empty. Asserted when AHB 2 buffer contains data</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB3NE</name>
                     <description>AHB 3 Buffer Not Empty. Asserted when AHB 3 buffer contains data</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB0FUL</name>
                     <description>AHB 0 Buffer Full. Asserted when AHB 0 buffer is full</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB1FUL</name>
                     <description>AHB 1 Buffer Full. Asserted when AHB 1 buffer is full</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB2FUL</name>
                     <description>AHB 2 Buffer Full. Asserted when AHB 2 buffer is full</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB3FUL</name>
                     <description>AHB 3 Buffer Full. Asserted when AHB 3 buffer is full</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXWE</name>
                     <description>RX Buffer Watermark Exceeded</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFULL</name>
                     <description>RX Buffer Full</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXDMA</name>
                     <description>RX Buffer DMA. Asserted when RX Buffer read out via DMA is active i.e DMA is requested or running</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEDA</name>
                     <description>Tx Buffer Enough Data Available</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXWA</name>
                     <description>TX Buffer watermark Available</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXDMA</name>
                     <description>TXDMA</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFULL</name>
                     <description>TX Buffer Full. Asserted when no more data can be stored</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FR</name>
               <description>Flag Register</description>
               <addressOffset>0x160</addressOffset>
               <resetValue>0x8000000</resetValue>
               <fields>
                  <field>
                     <name>TFF</name>
                     <description>IP Command Transaction Finished Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IPGEF</name>
                     <description>IP Command Trigger during AHB Grant Error Flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IPIEF</name>
                     <description>IP Command Trigger could not be executed Error Flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IPAEF</name>
                     <description>IP Command Trigger during AHB Access Error Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABOF</name>
                     <description>AHB Buffer Overflow Flag</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AIBSEF</name>
                     <description>AHB Illegal Burst Size Error Flag</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AITEF</name>
                     <description>AHB Illegal transaction error flag</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABSEF</name>
                     <description>AHB Sequence Error Flag</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RBDF</name>
                     <description>RX Buffer Drain Flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RBOF</name>
                     <description>RX Buffer Overflow Flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ILLINE</name>
                     <description>Illegal Instruction Error Flag</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TBUF</name>
                     <description>TX Buffer Underrun Flag</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TBFF</name>
                     <description>TX Buffer Fill Flag</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
