podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/QuadSPI_S32K148.svd.xml
            <register>
               <name>RSER</name>
               <description>Interrupt and DMA Request Select and Enable Register</description>
               <addressOffset>0x164</addressOffset>
               <fields>
                  <field>
                     <name>TFIE</name>
                     <description>Transaction Finished Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No TFF interrupt will be generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TFF interrupt will be generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IPGEIE</name>
                     <description>IP Command Trigger during AHB Grant Error Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No IPGEF interrupt will be generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>IPGEF interrupt will be generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IPIEIE</name>
                     <description>IP Command Trigger during IP Access Error Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No IPIEF interrupt will be generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>IPIEF interrupt will be generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IPAEIE</name>
                     <description>IP Command Trigger during AHB Access Error Interrupt Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No IPAEF interrupt will be generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>IPAEF interrupt will be generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ABOIE</name>
                     <description>AHB Buffer Overflow Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No ABOF interrupt will be generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>ABOF interrupt will be generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AIBSIE</name>
                     <description>AHB Illegal Burst Size Interrupt Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No AIBSEF interrupt will be generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>AIBSEF interrupt will be generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AITIE</name>
                     <description>AHB Illegal transaction interrupt enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No AITEF interrupt will be generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>AITEF interrupt will be generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ABSEIE</name>
                     <description>AHB Sequence Error Interrupt Enable: Triggered by ABSEF flags of QSPI_FR</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No ABSEF interrupt will be generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>ABSEF interrupt will be generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RBDIE</name>
                     <description>RX Buffer Drain Interrupt Enable: Enables generation of IRQ requests for RX Buffer Drain</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No RBDF interrupt will be generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>RBDF Interrupt will be generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RBOIE</name>
                     <description>RX Buffer Overflow Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No RBOF interrupt will be generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>RBOF interrupt will be generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RBDDE</name>
                     <description>RX Buffer Drain DMA Enable: Enables generation of DMA requests for RX Buffer Drain</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No DMA request will be generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA request will be generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ILLINIE</name>
                     <description>Illegal Instruction Error Interrupt Enable. Triggered by ILLINE flag in QSPI_FR</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No ILLINE interrupt will be generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>ILLINE interrupt will be generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RBDDE" > <name>TBFDE</name> <description>TX Buffer Fill DMA Enable</description> <bitOffset>25</bitOffset> </field>
                  <field>
                     <name>TBUIE</name>
                     <description>TX Buffer Underrun Interrupt Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No TBUF interrupt will be generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TBUF interrupt will be generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TBFIE</name>
                     <description>TX Buffer Fill Interrupt Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No TBFF interrupt will be generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TBFF interrupt will be generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPNDST</name>
               <description>Sequence Suspend Status Register</description>
               <addressOffset>0x168</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SUSPND</name>
                     <description>When set, it signifies that a sequence is in suspended state</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPDBUF</name>
                     <description>Suspended Buffer: Provides the suspended buffer number. Valid only when SUSPND is set to 1&apos;b1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATLFT</name>
                     <description>Data left: Provides information about the amount of data left to be read in the suspended sequence</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPTRCLR</name>
               <description>Sequence Pointer Clear Register</description>
               <addressOffset>0x16C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>BFPTRC</name>
                     <description>Buffer Pointer Clear: 1: Clears the sequence pointer for AHB accesses as defined in QuadSPI_BFGENCR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IPPTRC</name>
                     <description>IP Pointer Clear: 1: Clears the sequence pointer for IP accesses as defined in QuadSPI_IPCR This is a self-clearing field</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SFA1AD</name>
               <description>Serial Flash A1 Top Address</description>
               <addressOffset>0x180</addressOffset>
               <fields>
                  <field>
                     <name>TPADA1</name>
                     <description>Top address for Serial Flash A1. In effect, TPADxx is the first location of the next memory</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SFA2AD</name>
               <description>Serial Flash A2 Top Address</description>
               <addressOffset>0x184</addressOffset>
               <fields>
                  <field>
                     <name>TPADA2</name>
                     <description>Top address for Serial Flash A2. In effect, TPxxAD is the first location of the next memory</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SFB1AD</name>
               <description>Serial Flash B1 Top Address</description>
               <addressOffset>0x188</addressOffset>
               <fields>
                  <field>
                     <name>TPADB1</name>
                     <description>Top address for Serial Flash B1.In effect, TPxxAD is the first location of the next memory</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SFB2AD</name>
               <description>Serial Flash B2 Top Address</description>
               <addressOffset>0x18C</addressOffset>
               <fields>
                  <field>
                     <name>TPADB2</name>
                     <description>Top address for Serial Flash B2. In effect, TPxxAD is the first location of the next memory</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>32</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
               <name>RBDR%s</name>
               <description>RX Buffer Data Register</description>
               <addressOffset>0x200</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>RX Data</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>LUTKEY</name>
               <description>LUT Key Register</description>
               <addressOffset>0x300</addressOffset>
               <resetValue>0x5AF05AF0</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>The key to lock or unlock the LUT. The KEY is 0x5AF05AF0. The read value is always 0x5AF05AF0</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCKCR</name>
               <description>LUT Lock Configuration Register</description>
               <addressOffset>0x304</addressOffset>
               <resetValue>0x2</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>Locks the LUT when the following condition is met: This register is written just after the LUTKEYLUT Key Register The LUT key register was written with 0x5AF05AF0 key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNLOCK</name>
                     <description>Unlocks the LUT when the following two conditions are met: 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>64</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63</dimIndex>
               <name>LUT%s</name>
               <description>Look-up Table register</description>
               <addressOffset>0x310</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>OPRND0</name>
                     <description>Operand for INSTR0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PAD0</name>
                     <description>Pad information for INSTR0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>1 Pad</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>2 Pads</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>4 Pads</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>8 Pads</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSTR0</name>
                     <description>Instruction 0</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>OPRND1</name>
                     <description>Operand for INSTR1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field derivedFrom="PAD0" > <name>PAD1</name> <description>Pad information for INSTR1</description> <bitOffset>24</bitOffset> </field>
                  <field>
                     <name>INSTR1</name>
                     <description>Instruction 1</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
